Revit 2027 API
ExternalServices.BuiltInExternalServices.ForgeSchemaService Property
 Autodesk Internal: The service for interacting with the Forge Schema Service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ForgeSchemaService { get; }
Public Shared ReadOnly Property ForgeSchemaService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ForgeSchemaService {
	ExternalServiceId^ get ();
}
static member ForgeSchemaService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace